testing/artillery.yaml
# artillery-pusher-enhanced.yaml
# Load Testing untuk Live Cam dengan Pusher - Enhanced Version
# Sesuai dengan Parameter Penelitian Skripsi

config:
  target: "https://pusher.muncak.id"
  
  # Testing dilakukan pada stream aktif spesifik
  defaults:
    activeStreamSlug: "quam-modi-dolor-exercitation-voluptates-quasi-culpa-ut-fugiat-aP8DAM"
  
  
  phases:
    # Safe Configuration for Pusher Free Tier
    # Max 30 concurrent users, 30s per phase
    # Total: 3 menit per test, 5 apps = 5 iterations guaranteed
    # Safety buffer: 70% (30/100 concurrent limit)
    
    # Phase 1: Baseline (5 concurrent users)
    - duration: 30
      arrivalRate: 5
      name: "Baseline - 5 Concurrent Viewers"
    
    # Phase 2: Low Load (10 concurrent users)
    - duration: 30
      arrivalRate: 10
      name: "Low Load - 10 Concurrent Viewers"
    
    # Phase 3: Medium Load (15 concurrent users)
    - duration: 30
      arrivalRate: 15
      name: "Medium Load - 15 Concurrent Viewers"
    
    # Phase 4: Moderate Load (20 concurrent users)
    - duration: 30
      arrivalRate: 20
      name: "Moderate Load - 20 Concurrent Viewers"
    
    # Phase 5: Higher Load (25 concurrent users)
    - duration: 30
      arrivalRate: 25
      name: "Higher Load - 25 Concurrent Viewers"
    
    # Phase 6: Peak Load (30 concurrent users)
    - duration: 30
      arrivalRate: 30
      name: "Peak Load - 30 Concurrent Viewers (Safe Zone)"

  # Plugins removed - causing extensibility issues with Artillery 2.x
  
  variables:
    pusherKey: "3b7e0d850b4ba0c792a5"
    pusherCluster: "ap1"
    
    # Video quality yang ditest (sesuai batasan masalah)
    videoResolution:
      - "720p"
      - "1080p"

  processor: "./test-processor.js"

  # SLA sesuai parameter penelitian
  ensure:
    maxErrorRate: 1          # Error rate < 1%
    p95: 2000                # Latency p95 < 2s
    p99: 5000                # Latency p99 < 5s
    medianLatency: 1000      # Median latency < 1s

scenarios:
  # Scenario 1: Viewer menonton stream (70% traffic)
  - name: "Viewer - Watch Live Stream"
    weight: 70
    flow:
      # 1. Load halaman live cam
      - get:
          url: "/live-cam/{{ activeStreamSlug }}"
          capture:
            - json: "$.stream.id"
              as: "streamId"
          afterResponse: "recordPageLoadTime"
      
      - think: 1
      
      # 2. Establish Pusher WebSocket connection
      - function: "connectPusher"
      
      # Metrics: Connection Establishment Time
      - function: "measureConnectionTime"
      
      # 3. Subscribe to stream channel
      - function: "subscribeToStreamChannel"
      
      # Metrics: Subscribe latency
      - function: "measureSubscribeLatency"
      
      # 4. Initialize WebRTC connection
      - function: "initializeWebRTC"
      
      # 5. Receive video stream via WebSocket
      # WebSocket untuk streaming video 1 arah dari streamer ke viewers
      - think: 2
      
      # 6. Monitor streaming metrics (10x loop = ~90 detik)
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      - function: "measureFrameRate"
      - function: "measureVideoLatency"
      - function: "checkConnectionQuality"
      - think: 10
      
      # 7. Disconnect setelah 1 jam
      - function: "disconnectPusher"
      - function: "closeVideoStream"

  # Scenario 2: Viewer dengan interaksi chat (20% traffic)
  - name: "Viewer - Watch & Chat"
    weight: 20
    flow:
      - get:
          url: "/live-cam/{{ activeStreamSlug }}"
      
      - think: 1
      - function: "connectPusher"
      - function: "subscribeToStreamChannel"
      - function: "subscribeToChat"
      - function: "connectToVideoStream"
      
      # Load chat history
      - get:
          url: "/api/live-cam/{{ activeStreamSlug }}/chat"
          afterResponse: "recordChatLoadLatency"
      
      # Send chat messages while watching (5x)
      - function: "sendChatMessage"
      - function: "measureChatLatency"
      - think: 15
      
      - function: "sendChatMessage"
      - function: "measureChatLatency"
      - think: 15
      
      - function: "sendChatMessage"
      - function: "measureChatLatency"
      - think: 15
      
      - function: "sendChatMessage"
      - function: "measureChatLatency"
      - think: 15
      
      - function: "sendChatMessage"
      - function: "measureChatLatency"
      - think: 15
      
      # Watch selama ~30 menit (untuk scenario chat)
      - think: 1800
      - function: "disconnectPusher"
      - function: "closeVideoStream"

  # Scenario 3: Rapid join/leave - High churn (8% traffic)
  - name: "High Churn - Join/Leave Pattern"
    weight: 8
    flow:
      - get:
          url: "/live-cam/{{ activeStreamSlug }}"
      
      - function: "connectPusher"
      - function: "subscribeToStreamChannel"
      - function: "connectToVideoStream"
      
      # Measure quick connection/disconnection
      - function: "measureChurnLatency"
      
      # Stay only 10 seconds (channel surfer)
      - think: 10
      
      - function: "disconnectPusher"
      - function: "closeVideoStream"

  # Scenario 4: Monitor stream metadata (2% traffic)
  - name: "Stream Metadata Monitor"
    weight: 2
    flow:
      - get:
          url: "/api/live-cam/{{ activeStreamSlug }}/status"
          capture:
            - json: "$.viewers"
              as: "viewerCount"
            - json: "$.quality"
              as: "streamQuality"
          afterResponse: "recordMetadataLatency"
      
      - function: "connectPusher"
      - function: "subscribeToMetadata"
      
      # Monitor for 60 seconds
      - think: 60
      
      - function: "disconnectPusher"

# Metrics Khusus untuk Penelitian (Parameter dari Tabel 3.7.1)
metrics:
  # 1. LATENCY METRICS
  - name: "websocket.connection.latency"
    description: "Time to establish WebSocket connection (ms)"
    
  - name: "websocket.subscribe.latency"
    description: "Time to subscribe to Pusher channel (ms)"
    
  - name: "video.end_to_end.latency"
    description: "End-to-end video latency dari streamer ke viewer (ms)"
    
  - name: "chat.message.latency"
    description: "Chat message round-trip latency (ms)"
  
  # 2. THROUGHPUT METRICS
  - name: "websocket.messages.per_second"
    description: "WebSocket messages throughput (msg/s)"
    
  - name: "video.bitrate.average"
    description: "Average video bitrate (kbps)"
    
  - name: "video.frames.per_second"
    description: "Video frame rate (fps)"
  
  # 3. RESOURCE USAGE METRICS
  - name: "client.cpu.usage"
    description: "Client CPU usage percentage (%)"
    
  - name: "client.memory.usage"
    description: "Client memory usage (MB)"
    
  - name: "network.bandwidth.usage"
    description: "Network bandwidth usage (Mbps)"
  
  # 4. CONNECTION METRICS
  - name: "concurrent.connections.active"
    description: "Number of active concurrent connections"
    
  - name: "connections.established.total"
    description: "Total connections established"
    
  - name: "connections.failed.total"
    description: "Total failed connections"
  
  # 5. QUALITY METRICS
  - name: "video.quality.resolution"
    description: "Actual video resolution achieved"
    
  - name: "video.packets.lost"
    description: "Video packets lost (%)"
    
  - name: "stream.stability.score"
    description: "Stream stability score (0-100)"
  
  # 6. ERROR METRICS
  - name: "websocket.errors.total"
    description: "Total WebSocket errors"
    
  - name: "stream.errors.total"
    description: "Total streaming errors"
    
  - name: "disconnections.unexpected"
    description: "Unexpected disconnections"

# Hooks untuk monitoring
before:
  flow:
    - function: "setupMonitoring"
    - function: "initializeMetricsCollector"
    - function: "checkStreamActive"
    - log: "Starting Pusher WebSocket performance test"
    - log: "Target stream: {{ activeStreamSlug }}"

after:
  flow:
    - function: "collectAllMetrics"
    - function: "calculateStatistics"
    - function: "generatePerformanceReport"
    - function: "exportMetricsToCSV"
    - function: "generatePDFReport"
    - log: "Performance test completed"
    - log: "PDF report generated in results/ folder"
    - log: "Generating comparison data for Reverb test"

# Expectations sesuai SLA penelitian
expectations:
  # Latency Requirements
  - name: "WebSocket connection < 500ms (p95)"
    condition: "websocket.connection.latency.p95 < 500"
    
  - name: "Subscribe latency < 200ms (p95)"
    condition: "websocket.subscribe.latency.p95 < 200"
    
  - name: "Video latency < 3000ms (p95)"
    condition: "video.end_to_end.latency.p95 < 3000"
    
  - name: "Chat latency < 500ms (p95)"
    condition: "chat.message.latency.p95 < 500"

  # Throughput Requirements
  - name: "Handle 100+ messages/sec"
    condition: "websocket.messages.per_second.mean > 100"
    
  - name: "Maintain 30+ fps"
    condition: "video.frames.per_second.mean > 30"

  # Connection Requirements (Safe for Pusher Free Tier - 70% buffer)
  - name: "Support 30+ concurrent viewers"
    condition: "concurrent.connections.active.max > 30"
    
  - name: "Error rate < 1%"
    condition: "websocket.errors.total.rate < 1"

  # Quality Requirements
  - name: "Packet loss < 2%"
    condition: "video.packets.lost.mean < 2"
    
  - name: "Stream stability > 95%"
    condition: "stream.stability.score.mean > 95"

# Output configuration
output:
  json: "./results/pusher-performance-{{ $timestamp }}.json"
  html: "./results/pusher-performance-{{ $timestamp }}.html"
  csv: "./results/pusher-metrics-{{ $timestamp }}.csv"